In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
train = pd.read_csv('train.csv')

In [3]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
train.drop(['Cabin'], axis=1, inplace=True)

In [6]:
train[['Age']].isnull().sum() # Remove the missing values from 'Age' features

Age    177
dtype: int64

In [7]:
train[train['Age'].isna()].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,Q

In [8]:
train.set_index('PassengerId', inplace=True)

In [9]:
passenger_id = train[train['Age'].isna()].index
train.drop(passenger_id, axis=0, inplace=True)

In [10]:
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 714 entries, 1 to 891
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  714 non-null    int64
 1   Pclass    714 non-null    int64
 2   Name      714 non-null    object
 3   Sex       714 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     714 non-null    int64
 6   Parch     714 non-null    int64
 7   Ticket    714 non-null    object
 8   Fare      714 non-null    float64
 9   Embarked  712 non-null    object
dtypes: float64(2), int64(4), object(4)
memory usage: 61.4+ KB

In [11]:
passenger_id = train[train['Embarked'].isna()].index

In [12]:
train.drop(passenger_id, axis=0, inplace=True)

In [13]:
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 712 entries, 1 to 891
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  712 non-null    int64
 1   Pclass    712 non-null    int64
 2   Name      712 non-null    object
 3   Sex       712 non-null    object
 4   Age       712 non-null    float64
 5   SibSp     712 non-null    int64
 6   Parch     712 non-null    int64
 7   Ticket    712 non-null    object
 8   Fare      712 non-null    float64
 9   Embarked  712 non-null    object
dtypes: float64(2), int64(4), object(4)
memory usage: 61.2+ KB

In [14]:
train['Ticket'].nunique() # Too many categories, good to remove(Not much predictive power)

541

In [15]:
train['SibSp'].nunique()

6

In [16]:
train['Parch'].nunique()

7

In [17]:
train.drop(['Ticket'], axis=1, inplace=True)

In [18]:
train['Embarked'].nunique() # Right categorical variable

3

In [19]:
train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
PassengerId,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S

In [20]:
train.drop(['Name'], axis=1, inplace=True)

In [21]:
train.head()

             Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
PassengerId
1                   0       3    male  22.0      1      0   7.2500        S
2                   1       1  female  38.0      1      0  71.2833        C
3                   1       3  female  26.0      0      0   7.9250        S
4                   1       1  female  35.0      1      0  53.1000        S
5                   0       3    male  35.0      0      0   8.0500        S

In [22]:
train[['Sex', 'Embarked_Q', 'Embarked_S']] = pd.get_dummies(train[['Sex', 'Embarked']], drop_first=True)

In [23]:
train.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Embarked_Q,Embarked_S
PassengerId,,,,,,,,,,
1,0,3,1,22.0,1,0,7.2500,S,0,1
2,1,1,0,38.0,1,0,71.2833,C,0,0
3,1,3,0,26.0,0,0,7.9250,S,0,1
4,1,1,0,35.0,1,0,53.1000,S,0,1
5,0,3,1,35.0,0,0,8.0500,S,0,1

In [24]:
train.drop(['Embarked'], axis=1, inplace=True)

In [25]:
train.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked_Q,Embarked_S
PassengerId,,,,,,,,,
1,0,3,1,22.0,1,0,7.2500,0,1
2,1,1,0,38.0,1,0,71.2833,0,0
3,1,3,0,26.0,0,0,7.9250,0,1
4,1,1,0,35.0,1,0,53.1000,0,1
5,0,3,1,35.0,0,0,8.0500,0,1

In [26]:
X_train = train.drop(['Survived'], axis=1)
y_train = train['Survived']

### Model

In [27]:
from sklearn.ensemble import RandomForestClassifier

In [28]:
clf = RandomForestClassifier(n_estimators=500, max_leaf_nodes=5, n_jobs=-1)

In [29]:
clf.fit(X_train, y_train)

RandomForestClassifier(max_leaf_nodes=5, n_estimators=500, n_jobs=-1)

In [30]:
test = pd.read_csv('test.csv', index_col='PassengerId')

In [31]:
test.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [32]:
test.drop(['Name','Ticket', 'Cabin'], axis=1, inplace=True)

In [33]:
test.head()

             Pclass     Sex   Age  SibSp  Parch     Fare Embarked
PassengerId
892               3    male  34.5      0      0   7.8292        Q
893               3  female  47.0      1      0   7.0000        S
894               2    male  62.0      0      0   9.6875        Q
895               3    male  27.0      0      0   8.6625        S
896               3  female  22.0      1      1  12.2875        S

In [34]:
test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 418 entries, 892 to 1309
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Sex       418 non-null    object
 2   Age       332 non-null    float64
 3   SibSp     418 non-null    int64
 4   Parch     418 non-null    int64
 5   Fare      417 non-null    float64
 6   Embarked  418 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 26.1+ KB

In [38]:
estimated_age = round(test['Age'].mean(), 1)

In [40]:
test['Age'].fillna(estimated_age, inplace=True)

In [42]:
estimated_embarked_val = test['Embarked'].mode()
test['Embarked'].fillna(estimated_age, inplace=True)

In [43]:
test[['Sex', 'Embarked_Q',	'Embarked_S']] = pd.get_dummies(test[['Sex', 'Embarked']], drop_first=True)

In [44]:
test.drop(['Embarked'], axis=1, inplace=True)

In [45]:
test.head()

             Pclass  Sex   Age  SibSp  Parch     Fare  Embarked_Q  Embarked_S
PassengerId
892               3    1  34.5      0      0   7.8292           1           0
893               3    0  47.0      1      0   7.0000           0           1
894               2    1  62.0      0      0   9.6875           1           0
895               3    1  27.0      0      0   8.6625           0           1
896               3    0  22.0      1      1  12.2875           0           1

In [46]:
test.isnull().sum()

Pclass        0
Sex           0
Age           0
SibSp         0
Parch         0
Fare          1
Embarked_Q    0
Embarked_S    0
dtype: int64

In [47]:
test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 418 entries, 892 to 1309
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Pclass      418 non-null    int64
 1   Sex         418 non-null    uint8
 2   Age         418 non-null    float64
 3   SibSp       418 non-null    int64
 4   Parch       418 non-null    int64
 5   Fare        417 non-null    float64
 6   Embarked_Q  418 non-null    uint8
 7   Embarked_S  418 non-null    uint8
dtypes: float64(2), int64(3), uint8(3)
memory usage: 20.8 KB

In [49]:
estimated_fare = test['Fare'].mean()
test['Fare'].fillna(estimated_fare, inplace=True)

In [52]:
test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 418 entries, 892 to 1309
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Pclass      418 non-null    int64
 1   Sex         418 non-null    uint8
 2   Age         418 non-null    float64
 3   SibSp       418 non-null    int64
 4   Parch       418 non-null    int64
 5   Fare        418 non-null    float64
 6   Embarked_Q  418 non-null    uint8
 7   Embarked_S  418 non-null    uint8
dtypes: float64(2), int64(3), uint8(3)
memory usage: 37.0 KB

In [53]:
y_pred = clf.predict(test)

In [54]:
data = {
  'PassengerId': pd.Series(test.index),
  'Survived': pd.Series(y_pred)
}
result = pd.concat(data, axis=1)

In [55]:
result = result.set_index('PassengerId')

In [56]:
result.to_csv('Result.csv')